README.md
```mermaid
flowchart LR
     subgraph Integration Scenario
      subgraph License Hub
        direction TB
        PAPI(Permission API - auto-redeem)
        LAPI(License API)
        AAPI(Admin API)
      end  
      LAPI -->|get users licenses| edtechTC(Teacher UI)
      subgraph EdTech Application
        direction TB
      edtechTC -->|create trial-license| LAPI
      edtechSC(Student UI) -->|ask for accessible products| PAPI
      end  
        edtechShop(EdTech Shop) -->|create/update license| LAPI
        LiBO(Licensing Backoffice) -->|create License|AAPI
    end

  teacher[fa:fa-person-chalkboard Teacher] -->|purchase a license| edtechShop
  teacher -->|views license / try product| edtechTC
    
  support[fa:fa-headset Support EdTech] -->|administrate License| LiBO
  student[fa:fa-graduation-cap Student] -->|uses licensed content/app| edtechSC
```
